copenhagenatomics/CA_Embedded_Libraries/STM32/SPI/Src/W5500.c
#define setSn_MR(sn, mr)        WIZCHIP_WRITE(Sn_MR(sn),mr)
#define getSn_MR(sn)            WIZCHIP_READ(Sn_MR(sn))
#define setSn_CR(sn, cr)        WIZCHIP_WRITE(Sn_CR(sn), cr)
#define setSn_IR(sn, ir)        WIZCHIP_WRITE(Sn_IR(sn), (ir & 0x1F))
#define getSn_CR(sn)            WIZCHIP_READ(Sn_CR(sn))
#define getSn_SR(sn)            WIZCHIP_READ(Sn_SR(sn))
#define getSn_IR(sn)            (WIZCHIP_READ(Sn_IR(sn)) & 0x1F)
#define getSn_TXBUF_SIZE(sn)    WIZCHIP_READ(Sn_TXBUF_SIZE(sn))
#define getSn_RXBUF_SIZE(sn)    WIZCHIP_READ(Sn_RXBUF_SIZE(sn))
#define getSn_TX_WR(sn)         (((uint16_t)WIZCHIP_READ(Sn_TX_WR(sn)) << 8) + WIZCHIP_READ(WIZCHIP_OFFSET_INC(Sn_TX_WR(sn),1)))	
#define getSn_TxMAX(sn)         (((uint16_t)getSn_TXBUF_SIZE(sn)) << 10)
#define getSn_RxMAX(sn)         (((uint16_t)getSn_RXBUF_SIZE(sn)) << 10)
#define getSn_DPORT(sn)         (((uint16_t)WIZCHIP_READ(Sn_DPORT(sn)) << 8) + WIZCHIP_READ(WIZCHIP_OFFSET_INC(Sn_DPORT(sn),1)))
#define getSn_DIPR(sn, dipr)    WIZCHIP_READ_BUF(Sn_DIPR(sn), dipr, 4)
#define setSn_PORT(sn, port)  { WIZCHIP_WRITE(Sn_PORT(sn),   (uint8_t)(port >> 8)); \
                                WIZCHIP_WRITE(WIZCHIP_OFFSET_INC(Sn_PORT(sn),1), (uint8_t) port); }
#define setSn_TX_WR(sn, txwr) { WIZCHIP_WRITE(Sn_TX_WR(sn),   (uint8_t)(txwr>>8)); \
                                WIZCHIP_WRITE(WIZCHIP_OFFSET_INC(Sn_TX_WR(sn),1), (uint8_t) txwr); }
#define setSn_RX_RD(sn, rxrd) { WIZCHIP_WRITE(Sn_RX_RD(sn),   (uint8_t)(rxrd>>8)); \
                                WIZCHIP_WRITE(WIZCHIP_OFFSET_INC(Sn_RX_RD(sn),1), (uint8_t) rxrd); }
#define getSn_RX_RD(sn)         (((uint16_t)WIZCHIP_READ(Sn_RX_RD(sn)) << 8) + WIZCHIP_READ(WIZCHIP_OFFSET_INC(Sn_RX_RD(sn),1)))

// wizchip_conf

#define _WIZCHIP_IO_MODE_NONE_          0x0000
#define _WIZCHIP_IO_MODE_BUS_           0x0100 /**< Bus interface mode */
#define _WIZCHIP_IO_MODE_SPI_           0x0200 /**< SPI interface mode */

#define _WIZCHIP_IO_MODE_SPI_VDM_       (_WIZCHIP_IO_MODE_SPI_ + 1) /**< SPI interface mode for variable length data*/
#define _WIZCHIP_IO_MODE_SPI_FDM_       (_WIZCHIP_IO_MODE_SPI_ + 2) /**< SPI interface mode for fixed length data mode*/
#define _WIZCHIP_IO_MODE_SPI_5500_      (_WIZCHIP_IO_MODE_SPI_ + 3) /**< SPI interface mode for fixed length data mode*/

#define _WIZCHIP_ID_                    "W5500\0"

#define _WIZCHIP_IO_MODE_               _WIZCHIP_IO_MODE_SPI_VDM_

typedef   uint8_t   iodata_t;

typedef struct __WIZCHIP
{
    uint16_t  if_mode;               ///< host interface mode
    uint8_t   id[8];                 ///< @b WIZCHIP ID such as @b 5100, @b 5100S, @b 5200, @b 5500, and so on.
    struct _CRIS {
        void (*_enter)  (void);       ///< crtical section enter 
        void (*_exit) (void);         ///< critial section exit  
    }CRIS;
    struct _CS {
        void (*_select)  (void);      ///< @ref \_WIZCHIP_ selected
        void (*_deselect)(void);      ///< @ref \_WIZCHIP_ deselected
    }CS;
    union _IF {	  
        struct {
            iodata_t  (*_read_data)   (uint32_t AddrSel);
            void      (*_write_data)  (uint32_t AddrSel, iodata_t wb);
        } BUS;      
        struct {
            uint8_t (*_read_byte)   (void);
            void    (*_write_byte)  (uint8_t wb);
            void    (*_read_burst)  (uint8_t* pBuf, uint16_t len);
            void    (*_write_burst) (uint8_t* pBuf, uint16_t len);
        } SPI;
    }IF;
}_WIZCHIP;

// socket

#define CHECK_SOCKNUM()         do{ if(sn > _WIZCHIP_SOCK_NUM_)         return SOCKERR_SOCKNUM;     } while(0);
#define CHECK_SOCKMODE(mode)    do{ if((getSn_MR(sn) & 0x0F) != mode)   return SOCKERR_SOCKMODE;    } while(0);
#define CHECK_SOCKINIT()        do{ if((getSn_SR(sn) != SOCK_INIT))     return SOCKERR_SOCKINIT;    } while(0);
#define CHECK_SOCKDATA()        do{ if(len == 0)                        return SOCKERR_DATALEN;     } while(0);

typedef enum
{
    SO_FLAG,
    SO_TTL,
    SO_TOS,
    SO_MSS,
    SO_DESTIP,
    SO_DESTPORT,
    SO_KEEPALIVESEND,
    SO_KEEPALIVEAUTO,
    SO_SENDBUF,
    SO_RECVBUF,
    SO_STATUS,
    SO_REMAINSIZE,
    SO_PACKINFO
}sockopt_type;

#define SOCK_ANY_PORT_NUM  0xC000

#define SOCKET                uint8_t  ///< SOCKET type define for legacy driver

#define SOCK_OK               1        ///< Result is OK about socket process.
#define SOCK_BUSY             0        ///< Socket is busy on processing the operation. Valid only Non-block IO Mode.
#define SOCK_FATAL            -1000    ///< Result is fatal error about socket process.

#define SOCK_ERROR            0        
#define SOCKERR_SOCKNUM       (SOCK_ERROR - 1)     ///< Invalid socket number
#define SOCKERR_SOCKOPT       (SOCK_ERROR - 2)     ///< Invalid socket option
#define SOCKERR_SOCKINIT      (SOCK_ERROR - 3)     ///< Socket is not initialized or SIPR is Zero IP address when Sn_MR_TCP
#define SOCKERR_SOCKCLOSED    (SOCK_ERROR - 4)     ///< Socket unexpectedly closed.
#define SOCKERR_SOCKMODE      (SOCK_ERROR - 5)     ///< Invalid socket mode for socket operation.
#define SOCKERR_SOCKFLAG      (SOCK_ERROR - 6)     ///< Invalid socket flag
#define SOCKERR_SOCKSTATUS    (SOCK_ERROR - 7)     ///< Invalid socket status for socket operation.
#define SOCKERR_ARG           (SOCK_ERROR - 10)    ///< Invalid argument.
#define SOCKERR_PORTZERO      (SOCK_ERROR - 11)    ///< Port number is zero
#define SOCKERR_IPINVALID     (SOCK_ERROR - 12)    ///< Invalid IP address
#define SOCKERR_TIMEOUT       (SOCK_ERROR - 13)    ///< Timeout occurred
#define SOCKERR_DATALEN       (SOCK_ERROR - 14)    ///< Data length is zero or greater than buffer max size.
#define SOCKERR_BUFFER        (SOCK_ERROR - 15)    ///< Socket buffer is not enough for data communication.

#define SOCKFATAL_PACKLEN     (SOCK_FATAL - 1)     ///< Invalid packet length. Fatal Error.

/*
 * SOCKET FLAG
 */
#define SF_ETHER_OWN           (Sn_MR_MFEN)        ///< In @ref Sn_MR_MACRAW, Receive only the packet as broadcast, multicast and own packet
#define SF_IGMP_VER2           (Sn_MR_MC)          ///< In @ref Sn_MR_UDP with \ref SF_MULTI_ENABLE, Select IGMP version 2.   
#define SF_TCP_NODELAY         (Sn_MR_ND)          ///< In @ref Sn_MR_TCP, Use to nodelayed ack.
#define SF_MULTI_ENABLE        (Sn_MR_MULTI)       ///< In @ref Sn_MR_UDP, Enable multicast mode.

