copenhagenatomics/CA_Embedded_Libraries/STM32/SPI/Src/W5500.c
#define SF_BROAD_BLOCK         (Sn_MR_BCASTB)   ///< In @ref Sn_MR_UDP or @ref Sn_MR_MACRAW, Block broadcast packet. Valid only in W5500
#define SF_MULTI_BLOCK         (Sn_MR_MMB)      ///< In @ref Sn_MR_MACRAW, Block multicast packet. Valid only in W5500
#define SF_IPv6_BLOCK          (Sn_MR_MIP6B)    ///< In @ref Sn_MR_MACRAW, Block IPv6 packet. Valid only in W5500
#define SF_UNI_BLOCK           (Sn_MR_UCASTB)   ///< In @ref Sn_MR_UDP with \ref SF_MULTI_ENABLE. Valid only in W5500

#define SF_IO_NONBLOCK           0x01              ///< Socket nonblock io mode. It used parameter in \ref socket().

/*
 * UDP & MACRAW Packet Infomation
 */
#define PACK_FIRST               0x80              ///< In Non-TCP packet, It indicates to start receiving a packet. (When W5300, This flag can be applied)
#define PACK_REMAINED            0x01              ///< In Non-TCP packet, It indicates to remain a packet to be received. (When W5300, This flag can be applied)
#define PACK_COMPLETED           0x00              ///< In Non-TCP packet, It indicates to complete to receive a packet. (When W5300, This flag can be applied)

/***************************************************************************************************
** PRIVATE FUNCTION DECLARATIONS
***************************************************************************************************/

static void wizchipSelect();
static void wizchipUnselect();
static void wizchipReadBurst(uint8_t* buff, uint16_t len);
static void wizchipWriteBurst(uint8_t* buff, uint16_t len);
static void ethPortSelect(ethernetHandler_t *heth);

// W5500
uint8_t WIZCHIP_READ(uint32_t AddrSel);
void WIZCHIP_WRITE(uint32_t AddrSel, uint8_t wb);
void WIZCHIP_READ_BUF(uint32_t AddrSel, uint8_t* pBuf, uint16_t len);
void WIZCHIP_WRITE_BUF(uint32_t AddrSel, uint8_t* pBuf, uint16_t len);
uint16_t getSn_TX_FSR(uint8_t sn);
uint16_t getSn_RX_RSR(uint8_t sn);
void wiz_send_data(uint8_t sn, uint8_t *wizdata, uint16_t len);
void wiz_recv_data(uint8_t sn, uint8_t *wizdata, uint16_t len);

// wizchip_conf
static_wizchip_conf_t get_static_wizchip_conf(void);
void set_static_wizchip_conf(static_wizchip_conf_t static_wizchip_conf);
void wizchip_cris_enter(void);
void wizchip_cris_exit(void);
void wizchip_cs_select(void);
void wizchip_cs_deselect(void);
iodata_t wizchip_bus_readdata(uint32_t AddrSel);
void wizchip_bus_writedata(uint32_t AddrSel, iodata_t wb);
static void reg_wizchip_cs_cbfunc(void(*cs_sel)(void), void(*cs_desel)(void));
static void reg_wizchip_spi_cbfunc(uint8_t (*spi_rb)(void), void (*spi_wb)(uint8_t wb));
static void reg_wizchip_spiburst_cbfunc(void (*spi_rb)(uint8_t* pBuf, uint16_t len), void (*spi_wb)(uint8_t* pBuf, uint16_t len));
static void wizchip_sw_reset(void);
static int8_t wizchip_init(uint8_t* txsize, uint8_t* rxsize);
void wizchip_setnetinfo(wiz_NetInfo* pnetinfo);

// socket
static_socket_t get_static_socket(void);
void set_static_socket(static_socket_t static_socket);
int8_t socket(uint8_t sn, uint8_t protocol, uint16_t port, uint8_t flag);
int8_t close_socket(uint8_t sn);
int8_t listen(uint8_t sn);
int8_t disconnect(uint8_t sn);
int32_t send(uint8_t sn, uint8_t *buf, uint16_t len);
int32_t recv(uint8_t sn, uint8_t *buf, uint16_t len);
int8_t  getsockopt(uint8_t sn, sockopt_type sotype, void* arg);

/***************************************************************************************************
** PRIVATE OBJECTS
***************************************************************************************************/

// Can change over time is more than one physical Ethernet port is used
static ethernetHandler_t *currentEthernet = NULL;

static socket_t sockets[NO_OF_SOCKETS] = {0};
static uint16_t noOfOpenSockets = 0;

// wizchip_conf

_WIZCHIP WIZCHIP =
{
    _WIZCHIP_IO_MODE_,
    _WIZCHIP_ID_ ,
    {
        wizchip_cris_enter,
        wizchip_cris_exit
    },
    {
        wizchip_cs_select,
        wizchip_cs_deselect
    },
    {
        {
            wizchip_bus_readdata,
            wizchip_bus_writedata
        },

    }
};

static uint8_t    _DNS_[4];      // DNS server ip address
static dhcp_mode  _DHCP_;        // DHCP mode

// socket

static uint16_t sock_any_port = SOCK_ANY_PORT_NUM;
static uint16_t sock_io_mode = 0;
static uint16_t sock_is_sending = 0;
static uint16_t sock_remained_size[_WIZCHIP_SOCK_NUM_] = {0,0,};
uint8_t  sock_pack_info[_WIZCHIP_SOCK_NUM_] = {0,};

/***************************************************************************************************
** PRIVATE FUNCTION DEFINITIONS
***************************************************************************************************/

/*!
 * @brief   Callback function to select the W5500 SPI peripheral
*/
static void wizchipSelect()
{
    // Chip selected when the pin is grounded
    stmSetGpio(currentEthernet->select, false);
}

/*!
 * @brief   Callback function to unselect the W5500 SPI peripheral
*/
static void wizchipUnselect()
{
    stmSetGpio(currentEthernet->select, true);
}

/*!
 * @brief   Callback function to read a multi-bytes message
 * @param   buff Pointer to the buffer
 * @param   len Maximum length of the buffer
*/
static void wizchipReadBurst(uint8_t* buff, uint16_t len)
{
    HAL_SPI_Receive(currentEthernet->hspi, buff, len, HAL_MAX_DELAY);
}

/*!
 * @brief   Callback function to write a multi-bytes message
 * @param   buff Pointer to the buffer
 * @param   len Maximum length of the buffer
*/
static void wizchipWriteBurst(uint8_t* buff, uint16_t len)
{
    HAL_SPI_Transmit(currentEthernet->hspi, buff, len, HAL_MAX_DELAY);
}

/*!
 * @brief   Callback function to read a byte
 * @return  The byte that has been read
*/
static uint8_t wizchipReadByte()
{
    static uint8_t byte;
    wizchipReadBurst(&byte, sizeof(byte));
    return byte;
}

/*!
 * @brief   Callback function to write a byte
 * @param   byte The byte to be written
*/
static void wizchipWriteByte(uint8_t byte)
{
    wizchipWriteBurst(&byte, sizeof(byte));
}

/*!
 * @brief   Selection of the ethernet port
 * @param   heth Pointer to the ethernet handler to be selected
*/
static void ethPortSelect(ethernetHandler_t *heth)
{
    currentEthernet->static_wizchip_conf = get_static_wizchip_conf();
    currentEthernet->static_socket = get_static_socket();

    currentEthernet = heth;

    set_static_wizchip_conf(currentEthernet->static_wizchip_conf);
    set_static_socket(currentEthernet->static_socket);
}

/**************************************************************
*               From W5500
***************************************************************/

uint8_t WIZCHIP_READ(uint32_t AddrSel)
{
    uint8_t ret;
    uint8_t spi_data[3];

    WIZCHIP.CS._select();

    AddrSel |= (_W5500_SPI_READ_ | _W5500_SPI_VDM_OP_);

