copenhagenatomics/CA_Embedded_Libraries/STM32/SPI/Src/W5500.c
    if(!WIZCHIP.IF.SPI._read_burst || !WIZCHIP.IF.SPI._write_burst) 	// byte operation
    {
        WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
        WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
        WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
    }
    else																// burst operation
    {
        spi_data[0] = (AddrSel & 0x00FF0000) >> 16;
        spi_data[1] = (AddrSel & 0x0000FF00) >> 8;
        spi_data[2] = (AddrSel & 0x000000FF) >> 0;
        WIZCHIP.IF.SPI._write_burst(spi_data, 3);
    }
    ret = WIZCHIP.IF.SPI._read_byte();

    WIZCHIP.CS._deselect();
    return ret;
}

void WIZCHIP_WRITE(uint32_t AddrSel, uint8_t wb)
{
    uint8_t spi_data[4];
    WIZCHIP.CS._select();

    AddrSel |= (_W5500_SPI_WRITE_ | _W5500_SPI_VDM_OP_);

    if(!WIZCHIP.IF.SPI._write_burst) 	// byte operation
    {
        WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
        WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
        WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
        WIZCHIP.IF.SPI._write_byte(wb);
    }
    else									// burst operation
    {
        spi_data[0] = (AddrSel & 0x00FF0000) >> 16;
        spi_data[1] = (AddrSel & 0x0000FF00) >> 8;
        spi_data[2] = (AddrSel & 0x000000FF) >> 0;
        spi_data[3] = wb;
        WIZCHIP.IF.SPI._write_burst(spi_data, 4);
    }

    WIZCHIP.CS._deselect();
}
            
void WIZCHIP_READ_BUF(uint32_t AddrSel, uint8_t* pBuf, uint16_t len)
{
    uint8_t spi_data[3];
    uint16_t i;

    WIZCHIP.CS._select();

    AddrSel |= (_W5500_SPI_READ_ | _W5500_SPI_VDM_OP_);

    if(!WIZCHIP.IF.SPI._read_burst || !WIZCHIP.IF.SPI._write_burst) 	// byte operation
    {
        WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
        WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
        WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
        for(i = 0; i < len; i++)
            pBuf[i] = WIZCHIP.IF.SPI._read_byte();
    }
    else																// burst operation
    {
        spi_data[0] = (AddrSel & 0x00FF0000) >> 16;
        spi_data[1] = (AddrSel & 0x0000FF00) >> 8;
        spi_data[2] = (AddrSel & 0x000000FF) >> 0;
        WIZCHIP.IF.SPI._write_burst(spi_data, 3);
        WIZCHIP.IF.SPI._read_burst(pBuf, len);
    }

    WIZCHIP.CS._deselect();
}

void WIZCHIP_WRITE_BUF(uint32_t AddrSel, uint8_t* pBuf, uint16_t len)
{
    uint8_t spi_data[3];
    uint16_t i;

    WIZCHIP.CS._select();

    AddrSel |= (_W5500_SPI_WRITE_ | _W5500_SPI_VDM_OP_);

    if(!WIZCHIP.IF.SPI._write_burst) 	// byte operation
    {
        WIZCHIP.IF.SPI._write_byte((AddrSel & 0x00FF0000) >> 16);
        WIZCHIP.IF.SPI._write_byte((AddrSel & 0x0000FF00) >>  8);
        WIZCHIP.IF.SPI._write_byte((AddrSel & 0x000000FF) >>  0);
        for(i = 0; i < len; i++)
            WIZCHIP.IF.SPI._write_byte(pBuf[i]);
    }
    else									// burst operation
    {
        spi_data[0] = (AddrSel & 0x00FF0000) >> 16;
        spi_data[1] = (AddrSel & 0x0000FF00) >> 8;
        spi_data[2] = (AddrSel & 0x000000FF) >> 0;
        WIZCHIP.IF.SPI._write_burst(spi_data, 3);
        WIZCHIP.IF.SPI._write_burst(pBuf, len);
    }

    WIZCHIP.CS._deselect();
}

uint16_t getSn_TX_FSR(uint8_t sn)
{
    uint16_t val=0,val1=0;

    do
    {
        val1 = WIZCHIP_READ(Sn_TX_FSR(sn));
        val1 = (val1 << 8) + WIZCHIP_READ(WIZCHIP_OFFSET_INC(Sn_TX_FSR(sn),1));
        if (val1 != 0)
        {
          val = WIZCHIP_READ(Sn_TX_FSR(sn));
          val = (val << 8) + WIZCHIP_READ(WIZCHIP_OFFSET_INC(Sn_TX_FSR(sn),1));
        }
    }while (val != val1);
    return val;
}

uint16_t getSn_RX_RSR(uint8_t sn)
{
    uint16_t val=0,val1=0;

    do
    {
        val1 = WIZCHIP_READ(Sn_RX_RSR(sn));
        val1 = (val1 << 8) + WIZCHIP_READ(WIZCHIP_OFFSET_INC(Sn_RX_RSR(sn),1));
        if (val1 != 0)
        {
          val = WIZCHIP_READ(Sn_RX_RSR(sn));
          val = (val << 8) + WIZCHIP_READ(WIZCHIP_OFFSET_INC(Sn_RX_RSR(sn),1));
        }
    }while (val != val1);
    return val;
}

void wiz_send_data(uint8_t sn, uint8_t *wizdata, uint16_t len)
{
    uint16_t ptr = 0;
    uint32_t addrsel = 0;
    if(len == 0)  return;
    ptr = getSn_TX_WR(sn);
    addrsel = ((uint32_t)ptr << 8) + (WIZCHIP_TXBUF_BLOCK(sn) << 3);
    WIZCHIP_WRITE_BUF(addrsel,wizdata, len);
    ptr += len;
    setSn_TX_WR(sn,ptr);
}

void wiz_recv_data(uint8_t sn, uint8_t *wizdata, uint16_t len)
{
    uint16_t ptr = 0;
    uint32_t addrsel = 0;
    if(len == 0) return;
    ptr = getSn_RX_RD(sn);
    addrsel = ((uint32_t)ptr << 8) + (WIZCHIP_RXBUF_BLOCK(sn) << 3);
    WIZCHIP_READ_BUF(addrsel, wizdata, len);
    ptr += len;
    setSn_RX_RD(sn,ptr);
}

/**************************************************************
*               From wizchip_conf
***************************************************************/

static_wizchip_conf_t get_static_wizchip_conf(void)
{
    static_wizchip_conf_t static_wizchip_conf;
    for (int i = 0; i < 4; i++)
    {
        static_wizchip_conf.dns[i] = _DNS_[i];
    }
    static_wizchip_conf.dhcp = _DHCP_;
    return static_wizchip_conf;
}

void set_static_wizchip_conf(static_wizchip_conf_t static_wizchip_conf)
{
    for (int i = 0; i < 4; i++)
    {
        _DNS_[i] = static_wizchip_conf.dns[i];
    }
    _DHCP_ = static_wizchip_conf.dhcp;
}

void wizchip_cris_enter(void) {}

void wizchip_cris_exit(void) {}

void wizchip_cs_select(void) {}

void wizchip_cs_deselect(void) {}

iodata_t wizchip_bus_readdata(uint32_t AddrSel) { return * ((volatile iodata_t *)((ptrdiff_t) AddrSel)); }

void wizchip_bus_writedata(uint32_t AddrSel, iodata_t wb) { *((volatile iodata_t*)((ptrdiff_t)AddrSel)) = wb; }

static void reg_wizchip_cs_cbfunc(void(*cs_sel)(void), void(*cs_desel)(void))
{
    WIZCHIP.CS._select   = cs_sel;
    WIZCHIP.CS._deselect = cs_desel;
}

static void reg_wizchip_spi_cbfunc(uint8_t (*spi_rb)(void), void (*spi_wb)(uint8_t wb))
{
    WIZCHIP.IF.SPI._read_byte   = spi_rb;
    WIZCHIP.IF.SPI._write_byte  = spi_wb;
}

static void reg_wizchip_spiburst_cbfunc(void (*spi_rb)(uint8_t* pBuf, uint16_t len), void (*spi_wb)(uint8_t* pBuf, uint16_t len))
{
    WIZCHIP.IF.SPI._read_burst   = spi_rb;
    WIZCHIP.IF.SPI._write_burst  = spi_wb;
}

static void wizchip_sw_reset(void)
{
    uint8_t gw[4], sn[4], sip[4];
    uint8_t mac[6];
    getSHAR(mac);
    getGAR(gw);
    getSUBR(sn);
    getSIPR(sip);
    setMR(MR_RST);
    getMR(); // for delay
    setSHAR(mac);
    setGAR(gw);
    setSUBR(sn);
    setSIPR(sip);
}

static int8_t wizchip_init(uint8_t* txsize, uint8_t* rxsize)
{
    int8_t i;
    int8_t tmp = 0;
    wizchip_sw_reset();
    if(txsize)
    {
        tmp = 0;
        for(i = 0; i < _WIZCHIP_SOCK_NUM_; i++)
        {
            tmp += txsize[i];
            if(tmp > 16) return -1;
        }
        for(i = 0; i < _WIZCHIP_SOCK_NUM_; i++)
        {
            setSn_TXBUF_SIZE(i, txsize[i]);
        }	
    }
    if(rxsize)
    {
        tmp = 0;
        for(i = 0; i < _WIZCHIP_SOCK_NUM_; i++)
        {
            tmp += rxsize[i];
            if(tmp > 16) return -1;
        }
        for(i = 0; i < _WIZCHIP_SOCK_NUM_; i++)
        {
            setSn_RXBUF_SIZE(i, rxsize[i]);
        }
    }
    return 0;
}

void wizchip_setnetinfo(wiz_NetInfo* pnetinfo)
{
    setSHAR(pnetinfo->mac);
    setGAR(pnetinfo->gw);
    setSUBR(pnetinfo->sn);
    setSIPR(pnetinfo->ip);
    _DNS_[0] = pnetinfo->dns[0];
    _DNS_[1] = pnetinfo->dns[1];
    _DNS_[2] = pnetinfo->dns[2];
    _DNS_[3] = pnetinfo->dns[3];
    _DHCP_   = pnetinfo->dhcp;
}

/**************************************************************
*               From socket
***************************************************************/

static_socket_t get_static_socket(void)
{
    static_socket_t static_socket;
    static_socket.sockAnyPort = sock_any_port;
    static_socket.sockIoMode = sock_io_mode;
    static_socket.sockIsSending = sock_is_sending;
    for (int i = 0; i < _WIZCHIP_SOCK_NUM_; i++)
    {
        static_socket.sockRemainedSize[i] = sock_remained_size[i];
    }
    return static_socket;
}

void set_static_socket(static_socket_t static_socket)
{
    sock_any_port = static_socket.sockAnyPort;
    sock_io_mode = static_socket.sockIoMode;
    sock_is_sending = static_socket.sockIsSending;
    for (int i = 0; i < _WIZCHIP_SOCK_NUM_; i++)
    {
        sock_remained_size[i] = static_socket.sockRemainedSize[i];
    }
}

int8_t socket(uint8_t sn, uint8_t protocol, uint16_t port, uint8_t flag)
{
    CHECK_SOCKNUM();
    switch(protocol)
    {
        case Sn_MR_TCP :
            {
                uint32_t taddr;
                getSIPR((uint8_t*)&taddr);
                if(taddr == 0) return SOCKERR_SOCKINIT;
         break;
            }
        case Sn_MR_UDP :
        case Sn_MR_MACRAW :
        case Sn_MR_IPRAW :
            break;
        default :
            return SOCKERR_SOCKMODE;
    }
    if((flag & 0x04) != 0) return SOCKERR_SOCKFLAG;
        
    if(flag != 0)
    {
        switch(protocol)
        {
            case Sn_MR_TCP:
                  if((flag & (SF_TCP_NODELAY|SF_IO_NONBLOCK))==0) return SOCKERR_SOCKFLAG;
                break;
            case Sn_MR_UDP:
                if(flag & SF_IGMP_VER2)
                {
                    if((flag & SF_MULTI_ENABLE)==0) return SOCKERR_SOCKFLAG;
                }
                if(flag & SF_UNI_BLOCK)
                {
                    if((flag & SF_MULTI_ENABLE) == 0) return SOCKERR_SOCKFLAG;
                }
                break;
            default:
                break;
        }
    }
    close_socket(sn);
    setSn_MR(sn, (protocol | (flag & 0xF0)));
    if(!port)
    {
        port = sock_any_port++;
        if(sock_any_port == 0xFFF0) sock_any_port = SOCK_ANY_PORT_NUM;
    }
    setSn_PORT(sn,port);	
    setSn_CR(sn,Sn_CR_OPEN);
    while(getSn_CR(sn));
    sock_io_mode &= ~(1 <<sn);
    sock_io_mode |= ((flag & SF_IO_NONBLOCK) << sn);   
    sock_is_sending &= ~(1<<sn);
    sock_remained_size[sn] = 0;
    sock_pack_info[sn] = PACK_COMPLETED;
    while(getSn_SR(sn) == SOCK_CLOSED);
    return (int8_t)sn;
}	   

