copenhagenatomics/CA_Embedded_Libraries/STM32/SPI/Src/W5500.c
int8_t close_socket(uint8_t sn)
{
    setSn_CR(sn,Sn_CR_CLOSE);
    while( getSn_CR(sn) );
    setSn_IR(sn, 0xFF);
    sock_io_mode &= ~(1<<sn);
    sock_is_sending &= ~(1<<sn);
    sock_remained_size[sn] = 0;
    sock_pack_info[sn] = 0;
    while(getSn_SR(sn) != SOCK_CLOSED);
    return SOCK_OK;
}

int8_t listen(uint8_t sn)
{
    setSn_CR(sn,Sn_CR_LISTEN);
    while(getSn_CR(sn));
    while(getSn_SR(sn) != SOCK_LISTEN)
    {
        close_socket(sn);
        return SOCKERR_SOCKCLOSED;
    }
    return SOCK_OK;
}

int8_t disconnect(uint8_t sn)
{
    setSn_CR(sn,Sn_CR_DISCON);

    // Timeout for disconnect process (max 50ms)
    uint32_t startTime = HAL_GetTick();
    while (getSn_CR(sn)) {
        if (HAL_GetTick() - startTime > 50) {
            return SOCKERR_TIMEOUT;  // Prevent infinite loop
        }
    }

    sock_is_sending &= ~(1<<sn);
    if(sock_io_mode & (1<<sn)) return SOCK_BUSY;

    while(getSn_SR(sn) != SOCK_CLOSED)
    {
        if (HAL_GetTick() - startTime > 50) {
            close_socket(sn);
            return SOCKERR_TIMEOUT;
        }
    }

    return SOCK_OK;
}

int32_t send(uint8_t sn, uint8_t * buf, uint16_t len)
{
    uint8_t tmp=0;
    uint16_t freesize=0;
    
    CHECK_SOCKNUM();
    CHECK_SOCKMODE(Sn_MR_TCP);
    CHECK_SOCKDATA();
    tmp = getSn_SR(sn);
    if(tmp != SOCK_ESTABLISHED && tmp != SOCK_CLOSE_WAIT) return SOCKERR_SOCKSTATUS;
    if( sock_is_sending & (1<<sn) )
    {
        tmp = getSn_IR(sn);
        if(tmp & Sn_IR_SENDOK)
        {
            setSn_IR(sn, Sn_IR_SENDOK);
            sock_is_sending &= ~(1<<sn);         
        }
        else if(tmp & Sn_IR_TIMEOUT)
        {
            close_socket(sn);
            return SOCKERR_TIMEOUT;
        }
        else return SOCK_BUSY;
    }
    freesize = getSn_TxMAX(sn);
    if (len > freesize) len = freesize; // check size not to exceed MAX size.
    while(1)
    {
        freesize = getSn_TX_FSR(sn);
        tmp = getSn_SR(sn);
        if ((tmp != SOCK_ESTABLISHED) && (tmp != SOCK_CLOSE_WAIT))
        {
            close_socket(sn);
            return SOCKERR_SOCKSTATUS;
        }
        if( (sock_io_mode & (1<<sn)) && (len > freesize) ) return SOCK_BUSY;
        if(len <= freesize) break;
    }
    wiz_send_data(sn, buf, len);
    
    setSn_CR(sn,Sn_CR_SEND);
    /* wait to process the command... */
    while(getSn_CR(sn));
    sock_is_sending |= (1 << sn);

    return (int32_t)len;
}

int32_t recv(uint8_t sn, uint8_t * buf, uint16_t len)
{
    uint8_t  tmp = 0;
    uint16_t recvsize = 0;

    CHECK_SOCKNUM();
    CHECK_SOCKMODE(Sn_MR_TCP);
    CHECK_SOCKDATA();
    
    recvsize = getSn_RxMAX(sn);
    if(recvsize < len) len = recvsize;
    while(1)
    {
        recvsize = getSn_RX_RSR(sn);
        tmp = getSn_SR(sn);
        if (tmp != SOCK_ESTABLISHED)
        {
            if(tmp == SOCK_CLOSE_WAIT)
            {
                if(recvsize != 0) break;
                else if(getSn_TX_FSR(sn) == getSn_TxMAX(sn))
                {
                    close_socket(sn);
                    return SOCKERR_SOCKSTATUS;
                }
            }
            else
            {
                close_socket(sn);
                return SOCKERR_SOCKSTATUS;
            }
        }
        if((sock_io_mode & (1<<sn)) && (recvsize == 0)) return SOCK_BUSY;
        if(recvsize != 0) break;
    };

    if(recvsize < len) len = recvsize;   
    wiz_recv_data(sn, buf, len);
    setSn_CR(sn,Sn_CR_RECV);
    while(getSn_CR(sn));
    
    return (int32_t)len;
}

int8_t  getsockopt(uint8_t sn, sockopt_type sotype, void* arg)
{
    CHECK_SOCKNUM();
    switch(sotype)
    {
        case SO_DESTIP:
            getSn_DIPR(sn, (uint8_t*)arg);
            break;
        case SO_DESTPORT:  
            *(uint16_t*) arg = getSn_DPORT(sn);
            break;
        case SO_STATUS:
            *(uint8_t*) arg = getSn_SR(sn);
            break;
        default:
            return SOCKERR_SOCKOPT;
    }
    return SOCK_OK;
}

/***************************************************************************************************
** PUBLIC FUNCTION DEFINITIONS
***************************************************************************************************/

/*!
 * @brief   Callback function to write a byte
 * @param   heth Pointer to the ethernet handler
 * @param   hspi Pointer to associated SPI handler
 * @param   port Pointer to chip select GPIO block
 * @param   pin Chip select GPIO pin
 * @param   netInfo Network description
 * @param   sendBuf Pointer to micro-controller tx buffer
 * @return  0 on success, else negative value
 * @note    Should be called one time for each physical ethernet port
*/
int W5500Init(ethernetHandler_t *heth, SPI_HandleTypeDef *hspi, GPIO_TypeDef *port, uint16_t pin, wiz_NetInfo netInfo, char *sendBuf)
{
    currentEthernet = heth;

    currentEthernet->hspi = hspi;
    currentEthernet->netInfo = netInfo;
    stmGpioInit(&currentEthernet->select, port, pin, STM_GPIO_OUTPUT);
    currentEthernet->static_wizchip_conf = get_static_wizchip_conf();
    currentEthernet->static_socket = get_static_socket();
    currentEthernet->timeStamp = 0;
    currentEthernet->sendBuf = sendBuf;

    // Register W5500 callbacks
    reg_wizchip_cs_cbfunc(wizchipSelect, wizchipUnselect);
    reg_wizchip_spi_cbfunc(wizchipReadByte, wizchipWriteByte);
    reg_wizchip_spiburst_cbfunc(wizchipReadBurst, wizchipWriteBurst);

    // Define the buffer sizes for the 8 sockets in kB (32 kB available in total)
    static uint8_t txBufSize[8] = {8, 8, 0, 0, 0, 0, 0, 0};
    static uint8_t rxBufSize[8] = {8, 8, 0, 0, 0, 0, 0, 0};

    if (wizchip_init(txBufSize, rxBufSize) != 0)
    {
        return -1;
    }

    HAL_Delay(100);

    // To send the network parameters to the W5500
    wizchip_setnetinfo(&currentEthernet->netInfo);

    // TCP initialization

    for (uint16_t socketId = 0; socketId < NO_OF_SOCKETS; socketId++) {
        disconnect(socketId);
    }
    noOfOpenSockets = 0;

    return 0;
}

/*!
 * @brief   Implementation of the TCP server
 * @param   heth Physical ethernet port used
 * @return  >=0 on success, else negative value
 * @note    Should be used in the while(1) loop of the board for each physical ethernet port
*/
int W5500TCPServer(ethernetHandler_t* heth) {
    static const uint8_t INVALID_SOCKET = 0xffu;
    static uint8_t activeSocket         = INVALID_SOCKET;  // Start with an invalid socket

