copenhagenatomics/CA_Embedded_Libraries/STM32/SPI/Src/W5500.c
    // Switch ethernet physical port
    ethPortSelect(heth);

    for (uint8_t socketId = 0; socketId < NO_OF_SOCKETS; socketId++) {
        sockets[socketId].status = getSn_SR(socketId);

        switch (sockets[socketId].status) {
            case SOCK_ESTABLISHED:

                // If no active socket is set, this is the first connection
                if (activeSocket == INVALID_SOCKET) {
                    activeSocket = socketId;
                }
                // If this is the active socket, handle communication
                if (socketId == activeSocket) {
                    if (currentEthernet->newADCReady) {
                        send(socketId, (uint8_t*)currentEthernet->sendBuf,
                             strlen(currentEthernet->sendBuf));
                        currentEthernet->newADCReady = false;
                    }

                    // If the RX buffer contains data, receive it
                    if (getSn_RX_RSR(socketId) > 0) {
                        recv(socketId, (uint8_t*)currentEthernet->recvBuf, TCP_BUF_LEN);
                        currentEthernet->newMessage = true;
                        currentEthernet->timeStamp = HAL_GetTick();
                    }
                } else {
                    // New client detected, disconnect old one first
                    disconnect(activeSocket);  // Disconnect the previous client
                    activeSocket = socketId;    // Assign the new active socket
                }
                break;
            
            case SOCK_CLOSE_WAIT:
                // Disconnect the client and reset the active socket
                disconnect(socketId);
                activeSocket = INVALID_SOCKET;
                break;

            case SOCK_CLOSED:
                // Open a new TCP socket to listen for new clients
                if (socketId != activeSocket) {
                    socket(socketId, Sn_MR_TCP, PORT, 0);
                }
                break;

            case SOCK_INIT:
                // Start listening for new connections
                listen(socketId);
                break;

            case SOCK_LISTEN:
                // Waiting for a client connection
                break;

            default:
                sockets[socketId].error = true;
                break;
        }
    }

    return activeSocket;
}
